function [My] = Adjustment(Mx1)%参数是棋盘格绕轴转动两次后获得的三组点集
%棋盘格大小为12x9，角点数目为11x8，一组点为88个。

%首先求出每组轴的圆心坐标，用于定位轴线

A1_1 = Mx1(89:176,:) - Mx1(1:88,:);%棋盘格对应坐标差值分量▲X1,88行
A1_2 = Mx1(177:264,:) - Mx1(89:176,:);%棋盘格对应坐标差值分量▲X2，88行
B1_1 = 0.5*(Mx1(89:176,1).^2+Mx1(89:176,2).^2+Mx1(89:176,3).^2-Mx1(1:88,1).^2-Mx1(1:88,2).^2-Mx1(1:88,3).^2);
B1_2 = 0.5*(Mx1(177:264,1).^2+Mx1(177:264,2).^2+Mx1(177:264,3).^2-Mx1(89:176,1).^2-Mx1(89:176,2).^2-Mx1(89:176,3).^2);
%B1_1= 1/2*(dot(Mx1(89:176,:),Mx1(89:176,:))-dot(Mx1(1:88,:),Mx1(1:88,:)))%方程右边
%B1_2= 1/2*(dot(Mx1(177:264,:),Mx1(177:264,:))-dot(Mx1(89:176,:),Mx1(89:176,:)))%方程右边

for i = 1:88
    n(i,:) = cross(Mx1(i+176,:)-Mx1(i+88,:),Mx1(i+88,:)-Mx1(i,:));%n记录了每个角点构成平面的法向量
    %n(i,:)= n(i,:)/norm(n(i,:));%单位化
end


for i = 1:88
    A1_3(i,:) = n(i,:);%用来记录每个角点对应平面的法向量，88行
    B1_3(i,:) = (1/2)*(dot((Mx1(i,:)+Mx1(i+88,:)),n(i,:)));%对应方程右边
end

for i = 1:88
    A1_4(i,:) = n(i,:);%同上，88行
    B1_4(i,:) = 1/2*(dot((Mx1(i+176,:)+Mx1(i+88,:)),n(i,:)));%对应方程右边
end

A = [A1_1;A1_2;A1_3;A1_4];
B = [B1_1;B1_2;B1_3;B1_4];

C = (A'*A)\(A'*B);%圆心C

%接下来计算轴线向量,直接利用向量叉乘来计算轴线，并求取其均值
axis = n;%得到轴线向量，已经单位化过了
for i =1:88
    quiver3(C(1), C(2), C(3), axis(i,1), axis(i,2), axis(i,3),'k')
    hold on;
end

axis = mean(axis);%求其均值
quiver3(C(1), C(2), C(3), axis(1,1), axis(1,2), axis(1,3),'r')
hold on;
My = [C,axis'];%输出结果，第一列为圆心坐标，第二列为向量（单位化后）


end
