function [My] = CaculateAxxB(R,C)
Cnums = size(C,1)/4;%计算C的维度，有几个4x4的矩阵
Rnums = size(R,1)/4;%计算R的维度，有几个4x4的矩阵

%A = zeros(4, 4, 1);%创建一个4行4列的矩阵，初始化为0
%A(:, :, 1) = R(1:4,:)/R(5:8,:);%初始化为C1/C2
A = [];
for i = 1:Rnums
    for j = 1:Rnums
        if j ~= i
            new_pageA = R((i-1)*4+1:4*i,:)/R((j-1)*4+1:4*j,:);
            A = cat(3,A,new_pageA);
        end
    end
end

%B = zeros(4, 4, 1);%创建一个4行4列的矩阵，初始化为0
%B(:, :, 1) = C(1:4,:)/C(5:8,:);%初始化为C1/C2
B= [];
for i = 1:Cnums
    for j = 1:Cnums
        if j ~= i
            new_pageB = C((i-1)*4+1:4*i,:)/C((j-1)*4+1:4*j,:);
            B = cat(3,B,new_pageB);
        end
    end
end

% A1 = C1/C2;
% A2 = C2/C3;
% A3 = C3/C4;
% A4 = C4/C5;
% A5 = C5/C6;
% A6 = C6/C7;
% A7 = C7/C8;
% 
% B1 = R1/R2;
% B2 = R2/R3;
% B3 = R3/R4;
% B4 = R4/R5;
% B5 = R5/R6;
% B6 = R6/R7;
% B7 = R7/R8;
% A = zeros(4, 4, 7);  % 创建一个 4x4x4 的零矩阵，表示 4 个 4x4 的矩阵
% 
% % 设置第一页的矩阵
% A(:, :, 1) = A1;
% 
% % 设置第二页的矩阵
% A(:, :, 2) = A2;
% 
% % 设置第三页的矩阵
% A(:, :, 3) = A3;
% 
% % 设置第四页的矩阵
% A(:, :, 4) = A4;
% A(:, :, 5) = A5;
% A(:, :, 6) = A6;
% A(:, :, 7) = A7;
% 
% B = zeros(4, 4, 7);  % 创建一个 4x4x4 的零矩阵，表示 4 个 4x4 的矩阵
% 
% % 设置第一页的矩阵
% B(:, :, 1) = B1;
% 
% % 设置第二页的矩阵
% B(:, :, 2) = B2;
% 
% % 设置第三页的矩阵
% B(:, :, 3) = B3;
% 
% % 设置第四页的矩阵
% B(:, :, 4) = B4;
% B(:, :, 5) = B5;
% B(:, :, 6) = B6;
% B(:, :, 7) = B7;

X = AXXB(A,B);
My = X;
end