#include"Parameter_table.h"


long nums_1[6] = {0,1,2,3,4,5};//机械臂1的轴编号
double p2r_1[6] = {0.016/20000,0.024/40000,0.016/20000,0.1198/100000,0.0239/20000,0.1917/100000};//弧度对于凌华控制数字
double offset_1[6]={0};//0点位置补偿，因为机械臂1的编码器为相对位置编码器，每次重启都会将当前位置置为0，故不需要补偿
std::vector<double> tool_1 = {0,0,90.0};//工具坐标系偏移,x,y,z

long nums_2[6] = {6,7,8,9,10,11};//机械臂2的轴编号
double p2r_2[6] = {0.06/5000,0.06/5000,0.06/5000,0.06/5000,0.06/5000,0.06/5000};
double offset_2[6]={111458,206375,214858,160000,-100964,85206};//机械臂2的编码器为绝对值编码器，需要补偿0位
std::vector<double> tool_2 = {0.0,195.0,210.0};//工具坐标系偏移,x,y,z

//相机相对于机械臂1的位姿矩阵
std::vector<std::vector<double>> T_Robot2Camera = {{0.9280, -0.0158, -0.3723, 1008.2},
                                                   {-0.0629, -0.9914, -0.1146, 16.1310},
                                                   {-0.3672, 0.1297, -0.9210, 954.8813},
                                                   {0, 0, 0, 1  }};//利用AX=XB第二次算出的值


//相机相对于机械臂2的位姿矩阵
std::vector<std::vector<double>> T_Robot2Camera2 = {{-0.0022, -0.9974, -0.0719, 634.5334},
                                                    {-0.9140, -0.0272, 0.4049, -185.0396},
                                                    {-0.4058, 0.0666, -0.9115, 627.2335},
                                                    {0, 0, 0, 1  }};
